Suspected that the launch template id as the culprit since previously it was a composite id

```
resource "awscc_autoscaling_auto_scaling_group" "example" {
. . .
  launch_template = {
    version            = awscc_ec2_launch_template.example.latest_version_number
    launch_template_id = awscc_ec2_launch_template.example.id
  }
. . .
```

After I changed it to use the new id: 
```
resource "awscc_autoscaling_auto_scaling_group" "example" {
. . .
  launch_template = {
    version            = awscc_ec2_launch_template.example.latest_version_number
    launch_template_id = awscc_ec2_launch_template.example.launch_template_id
  }
. . .
```

a new plan emerges (notice now the `instance_id` is forcing replacement

```
Terraform will perform the following actions:

  # awscc_autoscaling_auto_scaling_group.example must be replaced
-/+ resource "awscc_autoscaling_auto_scaling_group" "example" {
      ~ auto_scaling_group_name               = "EpjqgIQ0jk2vwuYmTf5YQwoKO-dl3G43SUGkuA" -> (known after apply)
      ~ availability_zones                    = [
          - "us-east-1a",
          - "us-east-1b",
          - "us-east-1c",
        ] -> (known after apply)
      + capacity_rebalance                    = (known after apply)
      + context                               = (known after apply)
      ~ cooldown                              = "300" -> (known after apply)
      + default_instance_warmup               = (known after apply)
      + desired_capacity_type                 = (known after apply)
      ~ health_check_grace_period             = 0 -> (known after apply)
      ~ health_check_type                     = "EC2" -> (known after apply)
      ~ id                                    = "EpjqgIQ0jk2vwuYmTf5YQwoKO-dl3G43SUGkuA" -> (known after apply)
      + instance_id                           = (known after apply) # forces replacement
      + instance_maintenance_policy           = (known after apply)
      + launch_configuration_name             = (known after apply)
      ~ launch_template                       = {
          ~ launch_template_name = "204034886740-launch-template" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      + lifecycle_hook_specification_list     = (known after apply)
      + load_balancer_names                   = (known after apply)
      + max_instance_lifetime                 = (known after apply)
      + metrics_collection                    = (known after apply)
      + mixed_instances_policy                = (known after apply)
      ~ new_instances_protected_from_scale_in = false -> (known after apply)
      + notification_configuration            = (known after apply)
      + notification_configurations           = (known after apply)
      + placement_group                       = (known after apply)
      ~ service_linked_role_arn               = "arn:aws:iam::204034886740:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
      + tags                                  = (known after apply)
      + target_group_ar_ns                    = (known after apply)
      ~ termination_policies                  = [
          - "Default",
        ] -> (known after apply)
      ~ vpc_zone_identifier                   = [
          - "subnet-055dad5e3aaedbb14",
            "subnet-0bdc9d9f3bcc6c3b6",
            "subnet-00079939c5eccd47c",
          + "subnet-055dad5e3aaedbb14",
        ]
        # (3 unchanged attributes hidden)
    }
```